/**
 * 任务：已知圆锥的母线为 15，底面半径为 8，求圆锥的表面积。
 */


// 请在下面的Begin-End之间按照注释中给出的提示编写正确的代码


public class Circle {
}
/**
 * 任务：已知圆锥的母线为 15，底面半径为 8，求圆锥的表面积。
 */


// 请在下面的Begin-End之间按照注释中给出的提示编写正确的代码

/********** Begin **********/

// 定义一个圆类，类名为 Circle

// 定义两个量，分别为半径和π值


// 有参构造器


// 定义一个方法，实现求圆面积，将圆面积返回，返回类型为double


// 定义一个扇形类，类名为 Sector


// 有参构造器


// 定义一个方法，实现求圆锥侧面积，将侧面积返回，返回类型为double，


// 定义一个公开的圆锥类 Cone


/**
 * 定义一个方法，该方法实现计算圆锥的表面积，返回值为double
 */


// 定义主方法

// 通过有参构造创建圆对象，将底面半径设置为 8

// 通过有参构造创建扇形对象，将扇形所需的半径和母线传入

// 通过有参构造创建圆锥对象，将圆对象和矩形对象传入

// 调用计算圆锥表面积的方法

// 四舍五入格式化不换行输出圆锥表面积，输出格式：圆锥的表面积为xx

/********** End **********/